Repository: labilezhu/graphql-java-i18n-zh_cn
Catalog: translate-omegat.tmx
Source language: en_us
Languages: zh_cn

source: **Note**: Relay refers here to "Relay Classic", there is no support for "Relay Modern".
zh_cn: **注意**： 这里的 Relay 指 "Relay Classic", 暂不支持 "Relay Modern".

source: *3* calls over the network or to a database is much better than *15* calls you will agree.
zh_cn: *3* 次网络或DB访问，当然比 *15* 次牛B多了。【译者补】

source: A ``DataFetcher`` provides the data for a field (and changes something, if it is a mutation).
zh_cn: 对象 ``DataFetcher`` 作用是获取字段（field）对应的数据；另外，在修改(mutation)操作时，可以更新数据

source: A ``TypeResolver`` helps ``graphql-java`` to decide which type a concrete value belongs to.
zh_cn: 对象 ``TypeResolver`` 帮助 ``graphql-java`` 判断数据的实际类型(type).

source: A class derived from ``graphql.execution.ExecutionStrategy`` is used to run a query or mutation.
zh_cn: 在执行查询或更新数据时，引擎会使用实现了 ``graphql.execution.ExecutionStrategy``接口 的对象，来决定执行策略.

source: A common way to do that is use a JSON serialisation library like Jackson or GSON.
zh_cn: 一般用 Jackson or GSON 去做 JSON 序列化.

source: A data fetcher might look like this:
zh_cn: 简单 Data fetcher 示例:

source: A detailed tracing map will be created and placed in the ``extensions`` section of the result.
zh_cn: 详细的跟踪信息（ tracing map）会放在查询结果的 ``extensions（扩展）`` 部分。

source: A good starting point to learn more about mutating data in graphql is `http://graphql.org/learn/queries/#mutations <http://graphql.org/learn/queries/#mutations>`_.
zh_cn: 如果你不了解什么叫更新（Mutations），建议先阅读规范 `http://graphql.org/learn/queries/#mutations <http://graphql.org/learn/queries/#mutations>`_.

source: A naive implementation would called a `DataFetcher` to retrieved a person object every time it was invoked.
zh_cn: 一个直接的实现是为每个人物对象（person object）调用一次 `DataFetcher` 去获取数据。

source: A number of different strategies are provided with graphql-java and if you are really keen you can even write your own.
zh_cn: graphql-java 中已经有几个现成的策略，但如果你需要，你可以写自己的。.

source: A relay-compatible server will need to parse this JSON and pass the ``query`` string to this library as the query and the ``variables`` map as the third argument to ``execute`` as shown below.
zh_cn: relay 兼容的服务器，需要解释 JSON 然后传 ``query`` 字符串到本框架。包括 ``variables`` map 作为 ``execute`` 方法的第3个参数。如下：

source: A schema defines your GraphQL API by defining each field that can be queried or mutated.
zh_cn: Schema的主要用途是定义所有可供查询的字段（field），它们最终组合成一套完整的GraphQL API.

source: A simple `graphql.schema.visibility.BlockedFields` implementation based on fully qualified field name is provided.
zh_cn: 框架提供了一个可以指定字段(field)名的实现，叫 `graphql.schema.visibility.BlockedFields`..

source: Add the repositories:
zh_cn: 增加 repositories:

source: Add the repository:
zh_cn: 增加 repository:

source: Also see the page on subscriptions for more details on how to write a subscription based graphql service.
zh_cn: 也可以阅读subscriptions的文档，以了解如何编写基于支持订阅的 graphql 服务。

source: Alternatively, schemas with nested lists may benefit from using a ``graphql.execution.batched.BatchedExecutionStrategy`` and creating batched DataFetchers with get() methods annotated @Batched.
zh_cn: 对于有数组（list）field 的 schemas， 我们提供了 ``graphql.execution.batched.BatchedExecutionStrategy`` 策略。它可以批量化地调用标注了@Batched 的 DataFetchers 的 get() 方法。

source: An implementation of ``Instrumentation`` needs to implement the "begin" step methods that represent the execution of a graphql query.
zh_cn: 要实现 ``Instrumentation`` ，需要实现多个 "begin" 开头的方法。这方法会在查询执行过程中，每一步骤开始前被调用。

source: Another part of your system can extend this type to add more shape to it.
zh_cn: 你的系统的其它模块可以扩展这个类型：

source: Apollo Support
zh_cn: Apollo 支持

source: Apollo Tracing Instrumentation
zh_cn: Apollo跟踪与拦截（ Tracing Instrumentation）

source: Application concerns
zh_cn: 如何落地应用（Application concerns）

source: As `graphql` descends each level of the query ( eg as it processes `hero` and then `friends` and then for each their `friends`), the data loader is called to "promise" to deliver a person object.
zh_cn: 因 `graphql` 会批量化每个层级的查询。 ( 如先是 `hero` 之后是 `friends` 之后是他们的 `friends`), Data loader 返回了一个 " 期约（promise）"，期约会返回一个 person object.（人物对象）。

source: AsyncExecutionStrategy
zh_cn: 异步执行策略（AsyncExecutionStrategy）

source: AsyncSerialExecutionStrategy
zh_cn: 异步顺序执行策略（AsyncSerialExecutionStrategy）

source: Asynchronous Execution
zh_cn: 异步执行（Asynchronous Execution）

source: At each level `dataloader.dispatch()` will be called to fire off the batch requests for that part of the query.
zh_cn: 在查询的每个层级， `dataloader.dispatch()` 方法均会被调用一次，以获取真实的数据。

source: BatchedExecutionStrategy
zh_cn: 批量化执行器（BatchedExecutionStrategy）

source: Before the ``graphql-java`` engine executes a query it must be parsed and validated, and this process can be somewhat time consuming.
zh_cn: ``graphql-java`` 引擎执行查询前，必须先对查询语句作解释和校验，有时这是比较耗时的。

source: Build and test locally
zh_cn: 本地构建和测试

source: But if you are doing per request data loaders then creating a new set of ``GraphQL`` and ``DataLoader`` objects per request is super cheap.
zh_cn: 但如用你用请求级的 data loaders ，为每个请求创建 ``GraphQL`` and ``DataLoader`` 是花费很少资源的。

source: But its easy to implement inefficient code with naive loading of a graph of data.
zh_cn: 如果用简单直接的方法去获取每个field的数据，可能会效率很低。

source: By contributing to this project (commenting or opening PR/Issues etc) you are agreeing to follow this conduct, so please take the time to read it.
zh_cn: 为本项目作贡献（提交代码和问题等【译注原文：commenting or opening PR/Issues etc】）的同时，你即同意遵守这个行为规范，所以请你花时间认真阅读它.

source: By default every fields defined in a `GraphqlSchema` is available.
zh_cn: 所有 `GraphqlSchema` 的字段（field）默认都是可以访问的。

source: By default the "query" execution strategy is ``graphql.execution.AsyncExecutionStrategy`` which will dispatch each field as ``CompleteableFuture`` objects and not care which ones complete first.
zh_cn: 默认的查询 执行策略是 ``graphql.execution.AsyncExecutionStrategy`` ，它会把每个 field 返回视为 ``CompleteableFuture`` 。它并不会控制 filed 的获取顺序.

source: Caching data
zh_cn: 缓存数据

source: Chaining Instrumentation
zh_cn: 链式拦截（Chaining Instrumentation）

source: Check out http://reactivex.io/intro.html to find out more about creating Publishers of data and Subscriptions to that data.
zh_cn: 在 http://reactivex.io/intro.html 中可以看到更多创建Publishers 数据 和 Subscriptions 数据的细节。

source: Code of Conduct
zh_cn: 贡献或编码的行为规范

source: Code wiring via dependency injection
zh_cn: 依赖注入的编程方法

source: Context Objects
zh_cn: 上下文对象（Context Objects）

source: Contributions
zh_cn: 贡献

source: Create an instance of preferred cache instance, here is `Caffeine <https://github.com/ben-manes/caffeine>`_ used as it is a high quality caching solution.
zh_cn: 创建你需要的缓存实例，本例子是使用的是 `Caffeine <https://github.com/ben-manes/caffeine>`_ 。它是个高质量的缓存解决方案。

source: Creating a schema
zh_cn: 创建Schema

source: Creating a schema programmatically
zh_cn: 用代码方式创建 schema

source: Creating a schema using the SDL
zh_cn: 用 SDL 创建 Schema

source: Custom Instrumentation
zh_cn: 定制拦截器（Custom Instrumentation）

source: Data authorisation
zh_cn: 数据权限控制

source: Data pagination
zh_cn: 数据分页

source: DataFetcher and TypeResolver
zh_cn: DataFetcher 与 TypeResolver

source: Database access
zh_cn: 数据库访问

source: Dependency:
zh_cn: 依赖:

source: Documentation
zh_cn: 文档

source: Duplicate fields will be merged as one (however field re-definitions into new types are not allowed).
zh_cn: 重复的字段会被合并（但重定义一个字段的类型是不允许的）。

source: Each ``DataFetcher`` is passed a ``graphql.schema.DataFetchingEnvironment`` object which contains what field is being fetched, what arguments have been supplied to the field and other information such as the field's parent object, the query root object or the query context object.
zh_cn: 框架在执行查询时。会调用上面的方法，其中的 ``graphql.schema.DataFetchingEnvironment`` 参数包括以下信息：被查询的 field、查询这个field时可能带上的查询参数、这个field的父数据对象(Source Object)、 查询的ROOT数据对象、查询执行上下文环境对象(query context object).

source: Each graphql field type has a ``graphql.schema.DataFetcher`` associated with it.
zh_cn: 每个graphql schema 中的field，都需要绑定相应的 ``graphql.schema.DataFetcher`` 以获取数据.

source: Each step must give back a non null ``graphql.execution.instrumentation.InstrumentationContext`` object which will be called back when the step completes, and will be told that it succeeded or failed with a Throwable.
zh_cn: 所有回调方法，都应该返回 ``graphql.execution.instrumentation.InstrumentationContext`` 对象，这个对象会在本步骤完成时被回调用，回调用时会告知数据的获取结果，如果出错，可以获取 Throwable 对象。.

source: Even though the group of people have a lot of common friends.
zh_cn: 即使这群有有很多相同的朋友。

source: Every contribution to make this project better is welcome: Thank you!
zh_cn: 所有的贡献都是欢迎的。谢谢！

source: Every field definition has a ``DataFetcher``.
zh_cn: 每个字段都有自己的 ``DataFetcher``.

source: Exactly what threading strategy you use is up to your data fetcher code.
zh_cn: 而由DataFetcher控制具体的线程并发策略.

source: Example:
zh_cn: 如:

source: Exceptions while fetching data
zh_cn: 当获取数据出现异常时

source: Execution
zh_cn: 执行(Execution)

source: Execution Strategies
zh_cn: 关于执行策略（Execution Strategies）

source: ExecutorServiceExecutionStrategy
zh_cn: 基于执行器的执行策略：ExecutorServiceExecutionStrategy

source: Feel free to open a new `Issue <https://github.com/graphql-java/graphql-java/issues>`_
zh_cn: 请随时提出新 `Issue <https://github.com/graphql-java/graphql-java/issues>`_

source: Field Validation Instrumentation
zh_cn: 字段校验拦截器（Field Validation Instrumentation）

source: Finally, you can generate an executable schema by combining the static schema and the wiring together as shown in this example:
zh_cn: 最后，你可以通过整合静态 Schema 和 绑定（wiring），而生成一个可以执行的 Schema。

source: For example `nulls` are important in graphql results and hence you must set up the json mappers to include them.
zh_cn: 例如 JSON 的`nulls` 在 graphql 结果中的是有用的。所以必须在 json mappers 中设置需要它

source: For example imagine you have an ``Interface`` called *MagicUserType* which resolves back to a series of Java classes called *Wizard*, *Witch* and *Necromancer*.
zh_cn: 例如，你有一个 ``Interface`` 叫 *MagicUserType* 它有可能是以下的具体类型（Type） *Wizard*, *Witch* and *Necromancer*.

source: For example imagine your data fetcher threw this exception.
zh_cn: 例如，你在 DataFetcher 中抛出了这个异常.

source: For example the code above records the underlying exception and stack trace.
zh_cn: 例如，上面的代码记录了底层的异常和堆栈.

source: For example the edge of your application could be performing user detection and you need that information inside the graphql execution to perform authorisation.
zh_cn: 例如，你的应用的边界模块可能会做用户识别，然后 GraphQL 查询执行时，你可以想做数据权限控制。

source: For example:
zh_cn: 例如：

source: Getting started
zh_cn: 入门

source: GraphQL supports recursive types: For example a ``Person`` can contain a list of friends of the same type.
zh_cn: GraphQL 支持递归类型：如 ``Person（人）`` 可以包含很多朋友【译注：当然这些也是人类型的】

source: Graphql subscriptions allow you subscribe to a reactive source and as new data arrives then a graphql query is applied over that data and the results are passed on.
zh_cn: Graphql 订阅（subscriptions）使你可以让你订阅响应式数据源（reactive source） 。当有新数据时，会发送给订阅者。

source: Graphql subscriptions allows you to create stateful subscriptions to graphql data.
zh_cn: Graphql 订阅（subscriptions） 使你可以对GraphQL 数据进行为状态的订阅。

source: HTTP transfer
zh_cn: HTTP 转换

source: Having one large schema file is not always viable.
zh_cn: 很大的 Schema IDL 文件很难查看。

source: Hello World
zh_cn: Hello World【译注：这个用不翻译了吧 :) 】

source: Here is how you might put this in place:
zh_cn: 下面就是示例代码：

source: Here is the code for the standard behaviour.
zh_cn: 下面是默认的异常行为处理逻辑.

source: How to use the latest build with Gradle
zh_cn: 如果在 Gradle 中使用最新的开发中版本

source: How to use the latest build with Maven
zh_cn: 如果在 Maven 中使用最新的开发中版本

source: How to use the latest release with Gradle
zh_cn: 如何在 Gradle 中使用最新正式版本

source: How to use the latest release with Maven
zh_cn: 如果在 Maven 中使用最新正式版本

source: However exactly how they interpret the data result is particular to them.
zh_cn: 但他们对结果数据的转换方法有一些不同点.

source: However plenty of code out there is based on this SDL syntax and hence you can be fairly confident that you are building on solid technology ground.
zh_cn: 但JS参考实现中的很多代码也是基于SDL（IDL）语法的，所以你可以认为这语法是可以长期使用的.

source: However you will need to fetch your top level domain objects via your own custom data fetchers.
zh_cn: 但你最少需要为顶层的领域对象(domain objects) 编写 data fetchers.

source: If ``dataloader`` has seen a data item before, it will have cached the value and will return it without having to ask for it again.
zh_cn: ``dataloader``会缓存所有加载过的数据，使再次使用相同数据时，不需要再加载。

source: If a ``graphql.schema.DataFetcher`` returns a ``CompletableFuture<T>`` object then this will be composed into the overall asynchronous query execution.
zh_cn: 如果你编写的 ``graphql.schema.DataFetcher`` 返回 ``CompletableFuture<T>`` 对象，那么它会被糅合到整个异步查询中.

source: If an exception happens during the data fetcher call, then the execution strategy by default will make a ``graphql.ExceptionWhileDataFetching`` error and add it to the list of errors on the result.
zh_cn: 如果异步是出现在调用 data fetcher 时, 默认的执行策略(execution strategy) 将生成一个 ``graphql.ExceptionWhileDataFetching`` 错误，并将其加入到查询结果的错误列表中.

source: If errors are returned during this process then the query execution is aborted and the errors will be in the query result.
zh_cn: 如果校验失败，查询将停止，并返回错误信息。

source: If the exception you throw is itself a `GraphqlError` then it will transfer the message and custom extensions attributes from that exception into the `ExceptionWhileDataFetching` object.
zh_cn: 如果你抛出的异常本身是 `GraphqlError` 类型，框架会把其中的消息 和 自定义扩展属性（custom extensions attributes）转换到 `ExceptionWhileDataFetching` 对象中.

source: If this was not in place, then all the promises to data will never be dispatched ot the batch loader function and hence nothing would ever resolve.
zh_cn: 不然，期约（ promises ） 将不会被执行，就更不会有数据获取了。

source: If you are serving web requests then the data can be specific to the user requesting it.
zh_cn: 对于 Web 请求，请求的结果可能会因不同用户而不同的。

source: If you are unsure which option to use we recommend the SDL.
zh_cn: 如果你不确认用“java代码”还是用“GraphQL SDL(即IDL)”来定义你的Schema，那么我们建议你用SDL（IDL）

source: If you are using ``graphql``, you are likely to making queries on a graph of data (surprise surprise).
zh_cn: 使用 ``graphql``, 你很可能会去查询图结构的数据（graph of data ） (这可能是句废话).

source: If you have a question or want to discuss anything else related to this project:
zh_cn: 如果你有问题或想讨论与本项目相关的事:

source: If you have user specific data then you will not want to cache data meant for user A to then later give it to user B in a subsequent request.
zh_cn: 如果是特定用户的数据，你一定不希望用户A的数据，被用户B查询到。

source: If you use capabilities like `java.util.concurrent.CompletableFuture.supplyAsync()` then you can make it even more efficient by making the the remote calls asynchronous to the rest of the query.
zh_cn: 如果你使用了如 `java.util.concurrent.CompletableFuture.supplyAsync()` 的异步程序方式 。多个field的远程加载数据就可以并发进行了。.

source: If your data can be shared across web requests then you might want to scope your data loaders so they survive longer than the web request say.
zh_cn: 如果你需要的是不同请求间共享数据，所以你会希望 DataLoader 的生命周期更长。

source: If your don't specify a data fetcher on a field, this is what will be used.
zh_cn: 如果你未为 field 指定 data fetcher 那么就默认使用它.

source: Imagine we have the StarWars query outlined below.
zh_cn: 假设我们用以下的 StarWars 查询。

source: Imagine you have an stock market pricing service and you make a graphql subscription to it like this
zh_cn: 假设你有一个股票服务。可以用这个 graphql 语句来订阅它的数据：

source: Imagine you start with a type like this in one schema file.
zh_cn: 例如，一开始，你有这样一个文件：

source: In addition to the builder style shown above, ``TypeResolver`` s and ``DataFetcher`` s can also be wired in using the ``WiringFactory`` interface.
zh_cn: 除了上面的 builder 风格, ``TypeResolver`` s 与 ``DataFetcher`` s 也可以通过 ``WiringFactory`` 接口绑定在一起。

source: In essence you need to define a ``GraphQLObjectType`` that takes arguments as input.
zh_cn: 首先，你需要定义一个支持输入参数的 ``GraphQLObjectType`` .

source: In fact the code above is equivalent to the default settings and is a very sensible choice of execution strategies for most cases.
zh_cn: 实际上，上面就是引擎默认的策略了。大部分情况下用它就够了。

source: In fact under the covers, the graphql-java engine uses asynchronous execution and makes the ``.execute()`` method appear synchronous by calling join for you.
zh_cn: graphql-java引擎内部是异步执行的，但你可以通过调用 join 方法变为同步等待.

source: In order to achieve high cache hit ration it is recommended that field arguments are passed in as variables instead of directly in the query.
zh_cn: 为提高缓存命中率，GraphQL 语句中的 field 参数（arguments）建议使用变量（ variables）来表达，而不是直接把值写在语句中。

source: In order to make this a pleasant as possible for everybody involved, here are some tips:
zh_cn: 为了让大家快乐贡献，以下是一些提示：

source: In the above example there are only *5* unique people mentioned but with caching and batching retrieval in place their will be only *3* calls to the batch loader function.
zh_cn: 上例中，共有 *5* 个独立的 people。但当缓存和批量化开启后，只发起了 *3* 次调用 batch loader 方法的查询操作。

source: In the above example, the execution will wait for the data fetcher to return before moving on.
zh_cn: 上面是同步获取数据的例子，执行引擎需要等待一个 data fetcher 返回数据才能继续下一个.

source: In the case below the schema has been split into multiple files and merged all together just before schema generation.
zh_cn: 下面的例子是，在 Schema 生成前，合并多个独立的文件。

source: In this case it would be *15* calls over the network.
zh_cn: 这样你需要 *15* 次网络调用 。

source: Input arguments can ONLY be of that type and you cannot use output types such as ``GraphQLObjectType``.
zh_cn: 对于修改操作，输入参数只能用这个类型(type)，而不能用如 ``GraphQLObjectType``之类的输出类型(type).

source: Instrumentation
zh_cn: 拦截器Instrumentation

source: It asks us to find a hero and their friend's names and their friend's friend's names.
zh_cn: 这查询了一个英雄（ hero）和他朋友的名字，和他朋友的朋友的名字。

source: It differs from ``AsyncExecutionStrategy`` in that it does not rely on the data fetchers to be asynchronous but rather makes the field fetch invocation asynchronous by submitting each field to the provided `java.util.concurrent.ExecutorService`.
zh_cn: 它与 ``AsyncExecutionStrategy`` 执行策略不同，它不依赖 data fetchers 去异步执行获取任务，它依赖于输入的 `java.util.concurrent.ExecutorService` 。

source: It does not concern itself about other high level application concerns such as the following :
zh_cn: 它本身不关注应用的其它方面，如：

source: It does not concern itself with sending these over the network on things like web sockets and so on.
zh_cn: 它不关心如何在网络上用 web sockets 或其它手段发送流数据 。

source: It does not have to do *enemies* first followed by *friends*, which would be less efficient.
zh_cn: 而不需要先发获取 *enemies* 再获取 *friends*，那样效率更低。

source: It follows the Apollo proposed tracing format defined at `https://github.com/apollographql/apollo-tracing <https://github.com/apollographql/apollo-tracing>`_
zh_cn: 它按照 Apollo 跟踪格式 `https://github.com/apollographql/apollo-tracing <https://github.com/apollographql/apollo-tracing>`_ 来收集跟踪信息。

source: It is also not opinionated on user authorisation to that data.
zh_cn: 它也不关心你如果授权你的业务数据.

source: It is likely that many of these people will be friends in common.
zh_cn: 很多时候，他们有共同的朋友。

source: It will however assemble the results in order.
zh_cn: 这个策略不会按顺序来集成结果数据。

source: It would return a result like
zh_cn: 会返回如下的结果：

source: Its a pretty special case that I don't know how to explain properly
zh_cn: 它是如此的特别，让我不知道如何解释【译注：原文：Its a pretty special case that I don't know how to explain properly】

source: JSON endoding
zh_cn: JSON 编码

source: Java Example:
zh_cn: Java 例子：

source: Java code example:
zh_cn: java代码例子：

source: License
zh_cn: 发行授权

source: Limiting Field Visibility
zh_cn: 控制字段的可见性

source: Logging
zh_cn: 日志（Logging）

source: Logging is done with `SLF4J <http://www.slf4j.org/>`_.
zh_cn: 我们使用 `SLF4J <http://www.slf4j.org/>`_ 来记录日志。

source: Make sure ``mavenCentral`` is among your repos:
zh_cn: 首先，保证 ``mavenCentral`` 在你的 repos 库列表中:

source: Make sure to check out the `awesome related projects <https://github.com/graphql-java/awesome-graphql-java>`_ built on ``graphql-java``.
zh_cn: 强烈推荐你关注一下 基于 ``graphql-java`` 开发的 `相关项目 <https://github.com/graphql-java/awesome-graphql-java>`_ .

source: Modularising the Schema SDL
zh_cn: Schema IDL的模块化

source: More complex query examples can be found in the `StarWars query tests <https://github.com/graphql-java/graphql-java/blob/master/src/test/groovy/graphql/StarWarsQueryTest.groovy>`_
zh_cn: 更复杂的示例，可以看 `StarWars 查询测试用例 <https://github.com/graphql-java/graphql-java/blob/master/src/test/groovy/graphql/StarWarsQueryTest.groovy>`_

source: Mutations
zh_cn: 更新（Mutations）

source: NOTE: SDL is not currently part of the `formal graphql spec <https://facebook.github.io/graphql/#sec-Appendix-Grammar-Summary.Query-Document>`_.
zh_cn: 注意：SDL（IDL）现在还不是 `官方 graphql 规范 <https://facebook.github.io/graphql/#sec-Appendix-Grammar-Summary.Query-Document>`_.

source: Note that this puts your server in contravention of the graphql specification and expectations of most clients so use this with caution.
zh_cn: 请注意，这会使您的服务器违反graphql规范和大多数客户端的预期，因此请谨慎使用.

source: Notice how it calls a data store to mutate the backing database and then returns a ``Review`` object that can be used as the output values to the caller.
zh_cn: 上面代码，先更新业务数据，然后返回 ``Review`` 对象给调用方.

source: Notice that the input arguments are of type ``GraphQLInputObjectType``.
zh_cn: 注意，输入参数应该是 ``GraphQLInputObjectType`` 类型.

source: Now the exact details of how you get that stream of events is up to you and you're reactive code.
zh_cn: 如何获取流事件，就由你的 reactive code 来决定 了。

source: Often you can rely on ``graphql.schema.PropertyDataFetcher`` to examine Java POJO objects to provide field values from them.
zh_cn: 很多时候，你可以用默认的 ``graphql.schema.PropertyDataFetcher`` 去从 Java POJO 中自动提取数据到对应的 field.

source: One thing to note is the above only works if you use `DataLoaderDispatcherInstrumentation` which makes sure `dataLoader.dispatch()` is called.
zh_cn: 需要注意的是，只有你使用了 `DataLoaderDispatcherInstrumentation` ，上面说的才会生效。由它来调用 `dataLoader.dispatch()` 。

source: Only the execution of data fetching is free to be in any order.
zh_cn: 只是数据获取的顺序不确定。

source: Other graphql implementations often call this type of code *resolvers**.
zh_cn: 其它GraphQL的实现把这叫 *resolvers**.

source: Per Request Data Loaders
zh_cn: 查询范围的 Data Loaders

source: Please have a look at the `Manual <http://www.slf4j.org/manual.html>`_ for details.
zh_cn: 详情可以见 `手册 <http://www.slf4j.org/manual.html>`_ 。

source: Please look at `Latest Build <https://bintray.com/andimarek/graphql-java/graphql-java/_latestVersion>`_ for the latest version value.
zh_cn: 可以从 `最新版本 <https://bintray.com/andimarek/graphql-java/graphql-java/_latestVersion>`_ 中看到最新的版本号.

source: Please look at https://github.com/graphql-java/todomvc-relay-java for a full example project,
zh_cn: 完整的例子，见 https://github.com/graphql-java/todomvc-relay-java 。

source: Please note that this does not cache the result of the query, only the parsed ``Document``.
zh_cn: 它不是缓存 查询结果，只是缓存解释过的文档（ ``Document`` ）。

source: Please note that this project is released with a `Contributor Code of Conduct <https://github.com/graphql-java/graphql-java/blob/master/CODE_OF_CONDUCT.md>`_.
zh_cn: 请注意，这个项目的发行条款，包括了 `贡献或编码的行为规范 <https://github.com/graphql-java/graphql-java/blob/master/CODE_OF_CONDUCT.md>`_

source: Queries
zh_cn: 查询(Queries)

source: Query Caching
zh_cn: 查询缓存（Query Caching）

source: Questions and discussions
zh_cn: 问题与讨论

source: Relay Support
zh_cn: 关于 Relay 支持

source: Relay send queries to the GraphQL server as JSON containing a ``query`` field and a ``variables`` field.
zh_cn: Relay 以 JSON 格式，向服务器发送 ``query`` 和 ``variables`` 两个字段。

source: Remember graphql allows partial results with errors.
zh_cn: 请留意，GraphQL 在发生异常时，允许返回部分成功的数据，并将带上异常信息.

source: Runtime Exceptions
zh_cn: 运行期异常（Runtime Exceptions ）

source: Runtime exceptions can be thrown by the graphql engine if certain exceptional situations are encountered.
zh_cn: 在一些异常的情况下， graphql engine 有可能抛出 Runtime exceptions。

source: Scalars types are consider both input and output types.
zh_cn: Scalars 类型(type) 可以用于输入和输出.
